# Oval

## Description
Procedure Oval creates an oval object in a Vectorworks document.&lt;BR&gt;
&lt;BR&gt;

```pascal
PROCEDURE Oval(
				p1 : REAL;
				p2 : REAL);
```

```python

def vs.Oval(p1, p2):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|p1|REAL|Top left coordinate of oval bounding box.|
|p2|REAL|Bottom right coordinate of oval bounding box.|

## Version
Availability: from MiniCAD
## Category
* Objects - 2D